tap "homebrew/cask"
tap "mongodb/brew"

# Install Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew "bash"
brew "bash-completion2"

# Install binaries
brew "exiftool"
brew "git"
brew "gradle"
brew "htop"
brew "hugo"
brew "ktlint"
brew "node"
brew "openssl"
brew "pipenv"
brew "python"
brew "rename"
brew "scrcpy"
brew "tldr"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "z"

# Install Cask binaries
cask "1password"
cask "adobe-acrobat-reader"
cask "aerial"
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "androidtool"
cask "appcleaner"
cask "docker"
cask "dropbox"
cask "flux"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "magicprefs"
cask "postman"
cask "raindropio"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "sublime-text"
cask "teamviewer"
cask "typora"
cask "visual-studio-code"

# Install from Mac App Store
mas "Irvue", id: 1039633667
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
